# ЮХУ! Получилось оптимизнуть!=)))))))))))))))
# СТАРЫЙ КОД ----------------------------------------------------------------------------------------
# a = int(input('Введите количество копеек:'))

# if a == 1 or a == 21 or a == 31 or a == 41 or a == 51 or a == 61 or a == 71 or a == 81 or a == 91:
#     print('У вас', a, 'копейка')
#
# elif a == 2 or a == 22 or a == 32 or a == 42 or a == 52 or a == 62 or a == 72 or a == 82 or a == 92:
#     print('У вас', a, 'копейки')
#
# elif a == 3 or a == 23 or a == 33 or a == 43 or a == 53 or a == 63 or a == 73 or a == 83 or a == 93:
#     print('У вас', a, 'копейки')
#
# elif a == 4 or a == 24 or a == 34 or a == 44 or a == 54 or a == 64 or a == 74 or a == 84 or a == 94:
#     print('У вас', a, 'копейки')
#
# else:
#     print('У вас', a, 'копеек')
# СТАРЫЙ КОД ----------------------------------------------------------------------------------------

a = int(input('Введите количество копеек:'))

if a == 0:
    print('У вас нет денег=(')

elif a < 0:
    print('Так, уну не хитри!;)')

elif (a == 1 or a%10 == 1) and not a == 11:
    print('У вас', a, 'копейка')

elif (1 < a < 5 or 1 < a%10 < 5) and not 4 < a < 21:
    print('У вас', a, 'копейки')

elif 4 < a < 21 or a%10 > 4 or a%10 == 0:
    print('У вас', a, 'копеек')